import { IOpen } from '../interfaces/opens.interface';

/**
 * 默认开局配置
 */
export const wuyue: IOpen = {
  name: '无月',
  board: []
};

/**
 * 电脑开局配置
 */
export const xueyue: IOpen = {
  name: '血月',
  board: [[7, 7]]
};

/**
 * 随机开局配置
 */
export const opens: IOpen[] = [
  {
    name: '疏月',
    board: [
      [7, 7],
      [6, 7],
      [5, 5]
    ]
  },
  {
    name: '溪月',
    board: [
      [7, 7],
      [6, 7],
      [5, 6]
    ]
  },
  {
    name: '寒月',
    board: [
      [7, 7],
      [6, 7],
      [5, 7]
    ]
  },
  {
    name: '残月',
    board: [
      [7, 7],
      [6, 7],
      [6, 5]
    ]
  },
  {
    name: '花月',
    board: [
      [7, 7],
      [6, 7],
      [6, 6]
    ]
  },
  {
    name: '金月',
    board: [
      [7, 7],
      [6, 7],
      [7, 5]
    ]
  },
  {
    name: '雨月',
    board: [
      [7, 7],
      [6, 7],
      [7, 8]
    ]
  },
  {
    name: '新月',
    board: [
      [7, 7],
      [6, 7],
      [8, 5]
    ]
  },
  {
    name: '丘月',
    board: [
      [7, 7],
      [6, 7],
      [8, 6]
    ]
  },
  {
    name: '松月',
    board: [
      [7, 7],
      [6, 7],
      [8, 7]
    ]
  },
  {
    name: '游月',
    board: [
      [7, 7],
      [6, 7],
      [9, 5]
    ]
  },
  {
    name: '山月',
    board: [
      [7, 7],
      [6, 7],
      [9, 6]
    ]
  },
  {
    name: '瑞月',
    board: [
      [7, 7],
      [6, 7],
      [9, 7]
    ]
  },
  {
    name: '流月',
    board: [
      [7, 7],
      [6, 8],
      [5, 5]
    ]
  },
  {
    name: '水月',
    board: [
      [7, 7],
      [6, 8],
      [5, 6]
    ]
  },
  {
    name: '恒月',
    board: [
      [7, 7],
      [6, 8],
      [5, 7]
    ]
  },
  {
    name: '峡月',
    board: [
      [7, 7],
      [6, 8],
      [5, 8]
    ]
  },
  {
    name: '长月',
    board: [
      [7, 7],
      [6, 8],
      [5, 9]
    ]
  },
  {
    name: '岚月',
    board: [
      [7, 7],
      [6, 8],
      [6, 5]
    ]
  },
  {
    name: '浦月',
    board: [
      [7, 7],
      [6, 8],
      [6, 6]
    ]
  },
  {
    name: '云月',
    board: [
      [7, 7],
      [6, 8],
      [6, 7]
    ]
  },
  {
    name: '明月',
    board: [
      [7, 7],
      [6, 8],
      [7, 5]
    ]
  },
  {
    name: '银月',
    board: [
      [7, 7],
      [6, 8],
      [7, 6]
    ]
  },
  {
    name: '名月',
    board: [
      [7, 7],
      [6, 8],
      [8, 5]
    ]
  },
  {
    name: '斜月',
    board: [
      [7, 7],
      [6, 8],
      [8, 6]
    ]
  },
  {
    name: '慧月',
    board: [
      [7, 7],
      [6, 8],
      [9, 5]
    ]
  }
];
